// 3. Напишите программу, которая будет выдавать
// название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница

Console.WriteLine("Введите номер: ");
int number = Convert.ToInt32(Console.ReadLine());
if (number == 3) ;
{
    Console.WriteLine("Среда ");
}
    else if (number == 5) ;
{
    Console.WriteLine("Пятница ");
}